{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 128,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Lowercase"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          3
        ],
        "tokens": [
          "</s>"
        ]
      },
      "<s>": {
        "id": "<s>",
        "ids": [
          2
        ],
        "tokens": [
          "<s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<s>": 2,
      "</s>": 3,
      "<mask>": 4,
      "(": 5,
      ")": 6,
      "*": 7,
      "+": 8,
      ",": 9,
      "-": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      "[": 22,
      "]": 23,
      "a": 24,
      "b": 25,
      "c": 26,
      "d": 27,
      "e": 28,
      "f": 29,
      "g": 30,
      "h": 31,
      "i": 32,
      "j": 33,
      "k": 34,
      "l": 35,
      "m": 36,
      "n": 37,
      "o": 38,
      "p": 39,
      "q": 40,
      "r": 41,
      "s": 42,
      "t": 43,
      "u": 44,
      "v": 45,
      "w": 46,
      "x": 47,
      "y": 48,
      "z": 49,
      "0x": 50,
      "rd": 51,
      "mo": 52,
      "mov": 53,
      "tr": 54,
      "ptr": 55,
      "ord": 56,
      "word": 57,
      "ax": 58,
      "in": 59,
      "int": 60,
      "int3": 61,
      "qword": 62,
      "rax": 63,
      "rs": 64,
      "cx": 65,
      "rb": 66,
      "],": 67,
      "rcx": 68,
      "rsp": 69,
      "r1": 70,
      "0x1": 71,
      "al": 72,
      "0x2": 73,
      "ea": 74,
      "lea": 75,
      "eax": 76,
      "cal": 77,
      "call": 78,
      "rbp": 79,
      "rbx": 80,
      "dword": 81,
      "0x3": 82,
      "mp": 83,
      "te": 84,
      "rdx": 85,
      "r8": 86,
      "ip": 87,
      "rip": 88,
      "rdi": 89,
      "ed": 90,
      "0x4": 91,
      "ff": 92,
      "op": 93,
      "st": 94,
      "test": 95,
      "rsi": 96,
      "0x20": 97,
      "edx": 98,
      "0x5": 99,
      "or": 100,
      "00": 101,
      "je": 102,
      "cmp": 103,
      "r9": 104,
      "dd": 105,
      "eb": 106,
      "r14": 107,
      "xor": 108,
      "0x6": 109,
      "add": 110,
      "jmp": 111,
      "mm": 112,
      "0x7": 113,
      "xmm": 114,
      "ecx": 115,
      "jn": 116,
      "sh": 117,
      "0x10": 118,
      "0x8": 119,
      "ebx": 120,
      "0x30": 121,
      "jne": 122,
      "nop": 123,
      "r15": 124,
      "pu": 125,
      "pop": 126,
      "push": 127,
      "su": 128,
      "sub": 129,
      "r8d": 130,
      "by": 131,
      "byte": 132,
      "ffff": 133,
      "0x18": 134,
      "0x28": 135,
      "0x40": 136,
      "r12": 137,
      "0xa": 138,
      "0x9": 139,
      "r9d": 140,
      "edi": 141,
      "r13": 142,
      "0x38": 143,
      "et": 144,
      "r11": 145,
      "ret": 146,
      "10": 147,
      "0xc": 148,
      "an": 149,
      "and": 150,
      "xmm0": 151,
      "0xb": 152,
      "0x50": 153,
      "ps": 154,
      "si": 155,
      "xmmword": 156,
      "0x48": 157,
      "r10": 158,
      "esi": 159,
      "0xd": 160,
      "0x60": 161,
      "0xf": 162,
      "0x58": 163,
      "0xe": 164,
      "20": 165,
      "ups": 166,
      "movups": 167,
      "0x70": 168,
      "0000": 169,
      "zx": 170,
      "movzx": 171,
      "0x68": 172,
      "ffffffff": 173,
      "r14d": 174,
      "0x14": 175,
      "010": 176,
      "0x11": 177,
      "0x13": 178,
      "r15d": 179,
      "r12d": 180,
      "0x80": 181,
      "0x12": 182,
      "jb": 183,
      "xmm1": 184,
      "0x78": 185,
      "inc": 186,
      "0x15": 187,
      "0x19": 188,
      "0x800": 189,
      "a0": 190,
      "0x1c": 191,
      "r13d": 192,
      "60": 193,
      "0x17": 194,
      "ec": 195,
      "jns": 196,
      "movs": 197,
      "ebp": 198,
      "68": 199,
      "e0": 200,
      "40": 201,
      "30": 202,
      "b0": 203,
      "0x1f": 204,
      "70": 205,
      "50": 206,
      "0x29": 207,
      "ja": 208,
      "cc": 209,
      "a8": 210,
      "90": 211,
      "js": 212,
      "b8": 213,
      "38": 214,
      "e8": 215,
      "78": 216,
      "f8": 217,
      "28": 218,
      "xorps": 219,
      "d0": 220,
      "48": 221,
      "9c": 222,
      "0x21": 223,
      "r11d": 224,
      "r10d": 225,
      "ab": 226,
      "d8": 227,
      "cmov": 228,
      "54": 229,
      "3c": 230,
      "0xffffffff": 231,
      "0x27": 232,
      "0x90": 233,
      "f0": 234,
      "jl": 235,
      "dq": 236,
      "0x88": 237,
      "0x16": 238,
      "58": 239,
      "ac": 240,
      "98": 241,
      "7c": 242,
      "0x24": 243,
      "18": 244,
      "movsx": 245,
      "2c": 246,
      "14": 247,
      "a4": 248,
      "64": 249,
      "b4": 250,
      "6c": 251,
      "24": 252,
      "movdq": 253,
      "f4": 254,
      "74": 255,
      "0x2c": 256,
      "dc": 257,
      "0x8007": 258,
      "e4": 259,
      "fc": 260,
      "bb": 261,
      "1c": 262,
      "bc": 263,
      "0x34": 264,
      "94": 265,
      "jbe": 266,
      "5c": 267,
      "000": 268,
      "34": 269,
      "57": 270,
      "ne": 271,
      "d4": 272,
      "movsxd": 273,
      "0xa0": 274,
      "di": 275,
      "0x98": 276,
      "aa": 277,
      "0x1b": 278,
      "0x39": 279,
      "f1": 280,
      "0x31": 281,
      "0x22": 282,
      "ffffff": 283,
      "mu": 284,
      "mul": 285,
      "0x41": 286,
      "dl": 287,
      "0x3c": 288,
      "cl": 289,
      "0x44": 290,
      "0xa8": 291,
      "0xc0000": 292,
      "66": 293,
      "shr": 294,
      "bl": 295,
      "0x25": 296,
      "0x1d": 297,
      "23": 298,
      "0x1a": 299,
      "jae": 300,
      "fe": 301,
      "shl": 302,
      "0x23": 303,
      "0xb0": 304,
      "jle": 305,
      "0x26": 306,
      "9a": 307,
      "b1": 308,
      "e6": 309,
      "0x37": 310,
      "0x54": 311,
      "e5": 312,
      "fa": 313,
      "22": 314,
      "e1": 315,
      "0x64": 316,
      "e9": 317,
      "e7": 318,
      "e3": 319,
      "imul": 320,
      "63": 321,
      "0x7c": 322,
      "fd": 323,
      "0x47": 324,
      "0x49": 325,
      "0x2a": 326,
      "b2": 327,
      "55": 328,
      "69": 329,
      "6d": 330,
      "e2": 331,
      "5d": 332,
      "movdqu": 333,
      "17": 334,
      "37": 335,
      "67": 336,
      "ck": 337,
      "0x5c": 338,
      "62": 339,
      "lo": 340,
      "lock": 341,
      "f7": 342,
      "dil": 343,
      "0xc0": 344,
      "51": 345,
      "b9": 346,
      "0x32": 347,
      "0x67": 348,
      "f2": 349,
      "0x4c": 350,
      "0xd0": 351,
      "f9": 352,
      "0x3a": 353,
      "61": 354,
      "33": 355,
      "0xf0": 356,
      "59": 357,
      "0x59": 358,
      "fb": 359,
      "r8b": 360,
      "0x2d": 361,
      "0xb8": 362,
      "f3": 363,
      "jg": 364,
      "52": 365,
      "0x51": 366,
      "5a": 367,
      "53": 368,
      "0xc8": 369,
      "movab": 370,
      "movabs": 371,
      "6a": 372,
      "0xe0": 373,
      "b7": 374,
      "0x8c": 375,
      "d7": 376,
      "0xffffffffffffffff": 377,
      "movdqa": 378,
      "b3": 379,
      "0xd8": 380,
      "0x100": 381,
      "ba": 382,
      "0xa3": 383,
      "dec": 384,
      "0x33": 385,
      "0x77": 386,
      "04": 387,
      "21": 388,
      "bd": 389,
      "0x3d": 390,
      "0x61": 391,
      "27": 392,
      "5010": 393,
      "65": 394,
      "0x69": 395,
      "0x110": 396,
      "0x74": 397,
      "29": 398,
      "0x71": 399,
      "0x400": 400,
      "f5": 401,
      "0x57": 402,
      "0x79": 403,
      "2a": 404,
      "neg": 405,
      "0x7f": 406,
      "d1": 407,
      "0x3f": 408,
      "39": 409,
      "d9": 410,
      "4c": 411,
      "3a": 412,
      "0x800700": 413,
      "31": 414,
      "sil": 415,
      "movsd": 416,
      "0x8007000": 417,
      "da": 418,
      "0xa1": 419,
      "0x1e": 420,
      "0x6c": 421,
      "0x36": 422,
      "0x84": 423,
      "sbb": 424,
      "bp": 425,
      "19": 426,
      "0x2f": 427,
      "5e": 428,
      "cmovne": 429,
      "ar": 430,
      "sar": 431,
      "0xe8": 432,
      "6b": 433,
      "5b": 434,
      "d2": 435,
      "0x43": 436,
      "0xac": 437,
      "0x150": 438,
      "44": 439,
      "r9b": 440,
      "0xf8": 441,
      "ee": 442,
      "7a": 443,
      "0xf9": 444,
      "0x8007000e": 445,
      "0x55": 446,
      "f6": 447,
      "2b": 448,
      "ror": 449,
      "0x9c": 450,
      "cmove": 451,
      "0xc00000": 452,
      "99": 453,
      "0x96": 454,
      "0x35": 455,
      "3d": 456,
      "11": 457,
      "0x2b": 458,
      "0x8d": 459,
      "0x120": 460,
      "a7": 461,
      "0x80070057": 462,
      "0xffffff": 463,
      "000000": 464,
      "0x42": 465,
      "cmova": 466,
      "dx": 467,
      "6e": 468,
      "0x6f": 469,
      "0x180": 470,
      "aps": 471,
      "movaps": 472,
      "bx": 473,
      "12": 474,
      "a9": 475,
      "77": 476,
      "0x3b": 477,
      "2010": 478,
      "80": 479,
      "0xa3010": 480,
      "f010": 481,
      "6f": 482,
      "db": 483,
      "32": 484,
      "ef": 485,
      "c0": 486,
      "a1": 487,
      "0x3a0": 488,
      "0x80004": 489,
      "0x8000400": 490,
      "a80": 491,
      "0x4d": 492,
      "0x130": 493,
      "79": 494,
      "r14b": 495,
      "56": 496,
      "0x94": 497,
      "0xa5010": 498,
      "73": 499,
      "0x128": 500,
      "0x118": 501,
      "2d": 502,
      "r15b": 503,
      "a3": 504,
      "r12b": 505,
      "0x5d": 506,
      "0x5f": 507,
      "0x81": 508,
      "0xf9010": 509,
      "bt": 510,
      "be": 511,
      "71": 512,
      "c4": 513,
      "c8": 514,
      "jge": 515,
      "0x140": 516,
      "0xda": 517,
      "25": 518,
      "0x40010": 519,
      "0x2e": 520,
      "0x108": 521,
      "0x738": 522,
      "0xeb": 523,
      "3f": 524,
      "0x7a": 525,
      "xadd": 526,
      "7b": 527,
      "5f": 528,
      "91": 529,
      ":[": 530,
      "0xb4": 531,
      "gs": 532,
      "0xa4": 533,
      "0x5a": 534,
      "0x3a020": 535,
      "0xdd": 536,
      "bpl": 537,
      "d3": 538,
      "0x200": 539,
      "0x66": 540,
      "1010": 541,
      "0x80070000": 542,
      "0x170": 543,
      "r13b": 544,
      "0xea": 545,
      "b6": 546,
      "0x4a": 547,
      "0xffffffffffffff": 548,
      "ch": 549,
      "95": 550,
      "0x298": 551,
      "0xaf010": 552,
      "1a": 553,
      "0x45": 554,
      "0x7b": 555,
      "7f": 556,
      "0x82": 557,
      "0x138": 558,
      "0x160": 559,
      "set": 560,
      "0x72": 561,
      "0x53": 562,
      "xch": 563,
      "0xa120": 564,
      "xchg": 565,
      "0x9d": 566,
      "0x46": 567,
      "1d": 568,
      "0x104": 569,
      "0x56": 570,
      "92": 571,
      "b5": 572,
      "0x7ffffff": 573,
      "0x4f1": 574,
      "0x62": 575,
      "0xff": 576,
      "r15w": 577,
      "0000000": 578,
      "13": 579,
      "15": 580,
      "0x99": 581,
      "7d": 582,
      "0x7387c": 583,
      "0x188": 584,
      "0xc000000": 585,
      "0xbc": 586,
      "0x190": 587,
      "r8w": 588,
      "0x63": 589,
      "72": 590,
      "0x6d": 591,
      "0x158": 592,
      "76": 593,
      "bf": 594,
      "0x102": 595,
      "0xed": 596,
      "0x148": 597,
      "0x27010": 598,
      "0x5a80": 599,
      "0x9a": 600,
      "93": 601,
      "r14w": 602,
      "r12w": 603,
      "xmm2": 604,
      "0x93": 605,
      "0x65": 606,
      "0x1e0": 607,
      "0x1000": 608,
      "no": 609,
      "0x168": 610,
      "not": 611,
      "0xae": 612,
      "9d": 613,
      "0x178": 614,
      "cccc": 615,
      "a2": 616,
      "420": 617,
      "0x198": 618,
      "0x5e": 619,
      "0x7d": 620,
      "0xcc": 621,
      "0x300": 622,
      "0xb3": 623,
      "se": 624,
      "0xf0f8": 625,
      "0x8d54": 626,
      "0x73": 627,
      "0x80004005": 628,
      "0x107": 629,
      "sete": 630,
      "0x4f": 631,
      "0x5b": 632,
      "0x80070": 633,
      "0xc4": 634,
      "ad": 635,
      "0xe2": 636,
      "0xab": 637,
      "0x91": 638,
      "cmpxchg": 639,
      "97": 640,
      "0x87": 641,
      "0x75": 642,
      "setne": 643,
      "0x3e": 644,
      "0xc0000420": 645,
      "0x124": 646,
      "0x1a0": 647,
      "0x4b": 648,
      "0x42010": 649,
      "0x92": 650,
      "0x208": 651,
      "0x135010": 652,
      "0x76": 653,
      "96": 654,
      "3e": 655,
      "0xb9a": 656,
      "0x1c0": 657,
      "0xda10": 658,
      "9b": 659,
      "0x8a": 660,
      "1f": 661,
      "84": 662,
      "26": 663,
      "0x8000": 664,
      "0xb9a78": 665,
      "0xa7": 666,
      "0xb9": 667,
      "xmm6": 668,
      "0x240": 669,
      "36": 670,
      "a6": 671,
      "0x1b0": 672,
      "sd": 673,
      "504": 674,
      "0x1d0": 675,
      "0x7c4": 676,
      "ae": 677,
      "16": 678,
      "d6": 679,
      "0x270": 680,
      "1b": 681,
      "0x250": 682,
      "2e": 683,
      "0x14b": 684,
      "0x4e": 685,
      "0x10e": 686,
      "df": 687,
      "0x260": 688,
      "r9w": 689,
      "1e": 690,
      "0x4f168": 691,
      "0x41010": 692,
      "0x1f0": 693,
      "75": 694,
      "r13w": 695,
      "cc0": 696,
      "de": 697,
      "0x132": 698,
      "0xdc": 699,
      "404": 700,
      "0xec": 701,
      "0xae10": 702,
      "7e": 703,
      "0xffff": 704,
      "0xd4": 705,
      "2f": 706,
      "8c": 707,
      "0x228": 708,
      "a5": 709,
      "0x3e8": 710,
      "0x778": 711,
      "9f": 712,
      "0x86": 713,
      "3b": 714,
      "0xa2": 715,
      "0xe4": 716,
      "0xc000000d": 717,
      "0x9b": 718,
      "0x52": 719,
      "0x6a": 720,
      "35": 721,
      "0x230": 722,
      "0xba": 723,
      "0x85": 724,
      "00000": 725,
      "d5": 726,
      "0x1e8": 727,
      "0x7fffffff": 728,
      "88": 729,
      "0x12c": 730,
      "r10b": 731,
      "9e": 732,
      "0xa6": 733,
      "590": 734,
      "0xb1": 735,
      "bts": 736,
      "0x210": 737,
      "movss": 738,
      "0x3a010": 739,
      "ss": 740,
      "0xb2": 741,
      "aaaa": 742,
      "dc0": 743,
      "0x6b": 744,
      "0x89": 745,
      "0xfc": 746,
      "0x1d8": 747,
      "0xc7": 748,
      "xmm3": 749,
      "0x280": 750,
      "0x123": 751,
      "0x1c8": 752,
      "0x7e": 753,
      "0xfffffffffffffffe": 754,
      "0x1a8": 755,
      "0x134": 756,
      "0x83": 757,
      "0x1b8": 758,
      "0x84ac": 759,
      "0xd9": 760,
      "0xa9": 761,
      "0x121": 762,
      "0x97": 763,
      "488": 764,
      "af": 765,
      "0x1c010": 766,
      "0xa5": 767,
      "0xf4": 768,
      "0x55f4": 769,
      "0xbb1": 770,
      "208": 771,
      "0xcb": 772,
      "0xbb": 773,
      "0x8000ffff": 774,
      "0xbcc0": 775,
      "0xaa": 776,
      "0x95": 777,
      "0x8b": 778,
      "0x6e": 779,
      "0x220": 780,
      "0x150b0": 781,
      "0x969c": 782,
      "btr": 783,
      "0x238": 784,
      "0x258": 785,
      "div": 786,
      "0x8c504": 787,
      "0xc0000017": 788,
      "0x1073c": 789,
      "0x1eb": 790,
      "r11b": 791,
      "0x47010": 792,
      "b80": 793,
      "0x154": 794,
      "0xe2f8": 795,
      "cv": 796,
      "cvt": 797,
      "0x7f1": 798,
      "0xc1": 799,
      "0x96404": 800,
      "0xbb1b4": 801,
      "684": 802,
      "0x218": 803,
      "bc4": 804,
      "0x1f8": 805,
      "0xf3": 806,
      "0xb7": 807,
      "0x268": 808,
      "0xc9": 809,
      "0x14c": 810,
      "0x8f": 811,
      "0x10d": 812,
      "0x14b010": 813,
      "0x2a20": 814,
      "0x11c": 815,
      "0x13c": 816,
      "08": 817,
      "00000000000": 818,
      "0xdb": 819,
      "0x29874": 820,
      "0x114": 821,
      "0x248": 822,
      "0xc5": 823,
      "0xe9": 824,
      "0x3b2": 825,
      "0x101": 826,
      "29c": 827,
      "0x2f0": 828,
      "0x8000000": 829,
      "0x9f": 830,
      "0x330": 831,
      "260": 832,
      "0x13298": 833,
      "0xfd": 834,
      "0xf2010": 835,
      "688": 836,
      "0x2a0": 837,
      "0xcf010": 838,
      "0xc6": 839,
      "0x54590": 840,
      "0x30010": 841,
      "dd0": 842,
      "0x3c0": 843,
      "0x278": 844,
      "0xc3": 845,
      "0x17a": 846,
      "0x2b0": 847,
      "0x818": 848,
      "0xd5": 849,
      "0x1000000": 850,
      "0xd3": 851,
      "0xe1": 852,
      "0x20c": 853,
      "ebc": 854,
      "0xe6": 855,
      "0xef": 856,
      "0x663c": 857,
      "0x11d": 858,
      "0x10c": 859,
      "0x2a8": 860,
      "0x4ec": 861,
      "0xc00": 862,
      "2a0": 863,
      "0xcf": 864,
      "cdq": 865,
      "0x45d": 866,
      "0xf7": 867,
      "0xfffffffe": 868,
      "484": 869,
      "0x101010": 870,
      "0x20a": 871,
      "r10w": 872,
      "0x12b": 873,
      "0x15c": 874,
      "0x10e14": 875,
      "0xbf": 876,
      "0xd6": 877,
      "0x1e04": 878,
      "0x1ff": 879,
      "ffffffffffffff": 880,
      "0xad": 881,
      "10c": 882,
      "0xaf": 883,
      "0x7ffffffe": 884,
      "0x144": 885,
      "0xe7": 886,
      "0xffffffff8": 887,
      "0xac010": 888,
      "0xca": 889,
      "movq": 890,
      "0x308": 891,
      "0x9e": 892,
      "bs": 893,
      "0x1d4": 894,
      "0x10a": 895,
      "280": 896,
      "0x390": 897,
      "0x2d0": 898,
      "0xcd": 899,
      "0xffffffff8000000": 900,
      "0xb5": 901,
      "cmovae": 902,
      "0x8e": 903,
      "0xbd": 904,
      "0xd1": 905,
      "0x17f": 906,
      "680": 907,
      "0x1ab": 908,
      "0xdf": 909,
      "0x290": 910,
      "0x3f0": 911,
      "0x1cb": 912,
      "0x380": 913,
      "0x2e0": 914,
      "0x370": 915,
      "0xc2": 916,
      "0x12460": 917,
      "0xf1": 918,
      "0x2b8": 919,
      "0x11a": 920,
      "0x5dc0": 921,
      "ec0": 922,
      "0x360": 923,
      "ed4": 924,
      "0x2e8": 925,
      "0x3b29c": 926,
      "ce": 927,
      "0x320": 928,
      "0x10b": 929,
      "0x1ac": 930,
      "0x3d8": 931,
      "0xe5": 932,
      "0x3e0": 933,
      "0x206": 934,
      "0xb6": 935,
      "0xd2": 936,
      "50c": 937,
      "0x288": 938,
      "co": 939,
      "0x5bc4": 940,
      "mi": 941,
      "comi": 942,
      "0x310": 943,
      "0x2c0": 944,
      "0x32010": 945,
      "0x117": 946,
      "wa": 947,
      "0xd7": 948,
      "bswa": 949,
      "bswap": 950,
      "0x1212c": 951,
      "0x348": 952,
      "4d": 953,
      "0x9b4": 954,
      "0xe3": 955,
      "0x133": 956,
      "0x3e830": 957,
      "4a": 958,
      "0x410": 959,
      "0xbe": 960,
      "40c": 961,
      "cmovb": 962,
      "1c0": 963,
      "0x14010": 964,
      "0xb3b8": 965,
      "0x1ed": 966,
      "8a": 967,
      "0x350": 968,
      "63e": 969,
      "0xf5": 970,
      "0x1b4": 971,
      "0x328": 972,
      "0x5ca4": 973,
      "0x82ec": 974,
      "0x8007007a": 975,
      "eb0": 976,
      "0x13d": 977,
      "0x29260": 978,
      "eb8": 979,
      "3c8": 980,
      "0x8c5": 981,
      "0xfffff": 982,
      "0x1a4": 983,
      "0x147": 984,
      "64c": 985,
      "0x5de8": 986,
      "0x3e6": 987,
      "0xfa": 988,
      "0x17c": 989,
      "a0c": 990,
      "0x5d8": 991,
      "674": 992,
      "0x164": 993,
      "0x7ffffffffffffff": 994,
      "0x103": 995,
      "6c0": 996,
      "0x375": 997,
      "0x1e9": 998,
      "0x111": 999,
      "0x35c": 1000,
      "0x16c": 1001,
      "0x64010": 1002,
      "0x45da0": 1003,
      "0x1bc": 1004,
      "42": 1005,
      "0x1ec": 1006,
      "0x80004002": 1007,
      "0xa8b0": 1008,
      "0x9c1": 1009,
      "0x224": 1010,
      "380": 1011,
      "0x181": 1012,
      "0x139": 1013,
      "0x3f8": 1014,
      "0x358": 1015,
      "0x1dc": 1016,
      "0x820": 1017,
      "0x1ea": 1018,
      "0x7a0": 1019,
      "0x156": 1020,
      "0x22c": 1021,
      "0x12a": 1022,
      "0x9dd": 1023,
      "37f": 1024,
      "0x10264": 1025,
      "0x2ea": 1026,
      "0x3b0": 1027,
      "0x7e0": 1028,
      "0x778d8": 1029,
      "c3": 1030,
      "0x318": 1031,
      "0x113": 1032,
      "cdqe": 1033,
      "4b": 1034,
      "0xce": 1035,
      "0x1c1": 1036,
      "0x3ea": 1037,
      "0xfb": 1038,
      "0x151": 1039,
      "81": 1040,
      "cb": 1041,
      "ns": 1042,
      "0x142": 1043,
      "0x7ff": 1044,
      "0xfe": 1045,
      "49": 1046,
      "0x143": 1047,
      "9c0": 1048,
      "0x4ece0": 1049,
      "0x2fc": 1050,
      "0x11a80": 1051,
      "0xc0000095": 1052,
      "0x823": 1053,
      "0x184": 1054,
      "0x34c": 1055,
      "0x10000000": 1056,
      "0x2d8": 1057,
      "0x19c": 1058,
      "0x112": 1059,
      "cmovns": 1060,
      "ac8": 1061,
      "0x400000000000": 1062,
      "0x13a": 1063,
      "0x36010": 1064,
      "0x129": 1065,
      "0x1b3": 1066,
      "0x3d0": 1067,
      "0x4db0": 1068,
      "0x2f8": 1069,
      "0x149": 1070,
      "cccccccc": 1071,
      "45": 1072,
      "4f": 1073,
      "0x338": 1074,
      "c6": 1075,
      "0x37c": 1076,
      "0x157": 1077,
      "0x266": 1078,
      "0x3ff": 1079,
      "41": 1080,
      "4e": 1081,
      "0x7b4": 1082,
      "0x109": 1083,
      "0x18c": 1084,
      "0x234": 1085,
      "0x16a": 1086,
      "comisd": 1087,
      "0x418": 1088,
      "0x11010": 1089,
      "c9": 1090,
      "0x402a0": 1091,
      "216": 1092,
      "46": 1093,
      "83": 1094,
      "0x1bb": 1095,
      "0x3dd": 1096,
      "0x141": 1097,
      "ccd": 1098,
      "0x217": 1099,
      "0x254": 1100,
      "0x25c": 1101,
      "0x119": 1102,
      "0x2c8": 1103,
      "0x3a8": 1104,
      "0xee0": 1105,
      "0xc0000001": 1106,
      "0x778c4": 1107,
      "0x1e4": 1108,
      "0x340": 1109,
      "0xde": 1110,
      "480": 1111,
      "0x1e6": 1112,
      "14c": 1113,
      "0x470": 1114,
      "89": 1115,
      "0x126": 1116,
      "0x2b9": 1117,
      "r11w": 1118,
      "0x1c4": 1119,
      "0x23c": 1120,
      "444": 1121,
      "0x182": 1122,
      "0x22d0": 1123,
      "85": 1124,
      "0x174": 1125,
      "0x460": 1126,
      "0x127": 1127,
      "0x167": 1128,
      "980": 1129,
      "0x4129c": 1130,
      "0x1dd": 1131,
      "0x4830": 1132,
      "0x32a8": 1133,
      "0x430": 1134,
      "0x18a": 1135,
      "0x153": 1136,
      "0xf2": 1137,
      "580": 1138,
      "cd": 1139,
      "0xffffffff80000002": 1140,
      "0x29c": 1141,
      "0x24c": 1142,
      "2c0": 1143,
      "47": 1144,
      "c7": 1145,
      "0x15a": 1146,
      "0x1c3": 1147,
      "0x261": 1148,
      "0x26c": 1149,
      "0x11b": 1150,
      "0xd860": 1151,
      "0x3e4": 1152,
      "0x102ac": 1153,
      "0x3cc": 1154,
      "0x378": 1155,
      "0x152": 1156,
      "ca": 1157,
      "0x2f4": 1158,
      "0x4fa": 1159,
      "54a": 1160,
      "0xfffffffd": 1161,
      "0x388": 1162,
      "0x1b9": 1163,
      "0xfffff63e": 1164,
      "0x7a8": 1165,
      "0x131": 1166,
      "cmovl": 1167,
      "0x25010": 1168,
      "c5": 1169,
      "43": 1170,
      "0x105": 1171,
      "0x194": 1172,
      "cmovg": 1173,
      "0x1b5": 1174,
      "0x2ff": 1175,
      "ea0": 1176,
      "0x314": 1177,
      "0x322": 1178,
      "0x7fc": 1179,
      "0x307": 1180,
      "0x284": 1181,
      "0x163": 1182,
      "0x3c8": 1183,
      "0xab69": 1184,
      "0x3ec": 1185,
      "0x1e3": 1186,
      "0x2ed": 1187,
      "0x3fc": 1188,
      "5c0": 1189,
      "0xeaf8": 1190,
      "0x159": 1191,
      "82": 1192,
      "0x14a": 1193,
      "0x199": 1194,
      "dc4": 1195,
      "0x464": 1196,
      "0x14d": 1197,
      "0x29010": 1198,
      "0x136": 1199,
      "0x162": 1200,
      "6666": 1201,
      "0x375b8": 1202,
      "004": 1203,
      "0xce0": 1204,
      "0x15b": 1205,
      "384": 1206,
      "7c0": 1207,
      "1c4": 1208,
      "0x368": 1209,
      "0x420": 1210,
      "psr": 1211,
      "0x21c": 1212,
      "0x169": 1213,
      "0x125": 1214,
      "0x223": 1215,
      "0x4124": 1216,
      "0x1a1": 1217,
      "0x20019": 1218,
      "0xe010": 1219,
      "0x25f": 1220,
      "0x7f11": 1221,
      "0x20a9c": 1222,
      "cf": 1223,
      "0x116": 1224,
      "0x15d": 1225,
      "ldq": 1226,
      "0x354": 1227,
      "308": 1228,
      "0x1f4": 1229,
      "908": 1230,
      "aaaaaaaa": 1231,
      "psrldq": 1232,
      "c1": 1233,
      "c2": 1234,
      "0x197": 1235,
      "0x1c9": 1236,
      "0x17a78": 1237,
      "0x12a0": 1238,
      "a44": 1239,
      "e44": 1240,
      "movd": 1241,
      "0x183": 1242,
      "2c8": 1243,
      "0x1e1": 1244,
      "0x4e0": 1245,
      "0x187": 1246,
      "0x274": 1247,
      "0x2cc": 1248,
      "0x4d8": 1249,
      "si2": 1250,
      "ec4": 1251,
      "cvtsi2": 1252,
      "0x7f1137f": 1253,
      "0x264": 1254,
      "0x2e4": 1255,
      "0x1cc": 1256,
      "0x1e2": 1257,
      "0x115": 1258,
      "0x294": 1259,
      "288": 1260,
      "0x4e8": 1261,
      "0x24f": 1262,
      "1c8": 1263,
      "0x55a4": 1264,
      "23c": 1265,
      "0x357": 1266,
      "0x1aa": 1267,
      "0x478": 1268,
      "0x7688": 1269,
      "0x16d": 1270,
      "fc4": 1271,
      "0x23d": 1272,
      "0x1e5": 1273,
      "0x480": 1274,
      "409": 1275,
      "0x2ac": 1276,
      "0x33c": 1277,
      "0x106": 1278,
      "0x281": 1279,
      "0x4f8": 1280,
      "fa2": 1281,
      "ae0": 1282,
      "0x257": 1283,
      "0x2b3": 1284,
      "0x334": 1285,
      "f0c": 1286,
      "8d": 1287,
      "cmovs": 1288,
      "0x401": 1289,
      "0x27c": 1290,
      "0x269": 1291,
      "0x3eb": 1292,
      "0x204": 1293,
      "8e": 1294,
      "0x2b4": 1295,
      "0xf6": 1296,
      "284": 1297,
      "0xef58": 1298,
      "0x2ab": 1299,
      "ed0": 1300,
      "0x6d1": 1301,
      "0x28c": 1302,
      "0x1a7": 1303,
      "1500": 1304,
      "0x39c": 1305,
      "0x31c": 1306,
      "0x438": 1307,
      "0x458": 1308,
      "0x137": 1309,
      "0x179": 1310,
      "0x200000": 1311,
      "0x510": 1312,
      "0x304": 1313,
      "0x146": 1314,
      "d44": 1315,
      "e90": 1316,
      "0x20b": 1317,
      "0x80000": 1318,
      "ac0": 1319,
      "0x2c90": 1320,
      "86": 1321,
      "ep": 1322,
      "rep": 1323,
      "0x2a4": 1324,
      "0x21a": 1325,
      "6d8": 1326,
      "0x1e7": 1327,
      "0x367": 1328,
      "0x4f0": 1329,
      "0x189": 1330,
      "0x12d": 1331,
      "0x122": 1332,
      "0x17d": 1333,
      "68c": 1334,
      "0x161": 1335,
      "0x80070216": 1336,
      "210": 1337,
      "8f": 1338,
      "0x366": 1339,
      "0x1d1": 1340,
      "0x10e30": 1341,
      "0x5a4": 1342,
      "0x177": 1343,
      "0x391": 1344,
      "0x5a0": 1345,
      "0x80000000": 1346,
      "e38": 1347,
      "0x2e9": 1348,
      "0x764": 1349,
      "0x10f": 1350,
      "304": 1351,
      "0x10d3c": 1352,
      "5a0": 1353,
      "8b": 1354,
      "0x2bb": 1355,
      "0x468": 1356,
      "0x578": 1357,
      "87": 1358,
      "0x209": 1359,
      "98c": 1360,
      "0x324": 1361,
      "0x12f": 1362,
      "b88": 1363,
      "5c4": 1364,
      "0x3da": 1365,
      "0x3b8": 1366,
      "0x398": 1367,
      "sto": 1368,
      "b8c": 1369,
      "0x7260": 1370,
      "0x3a4": 1371,
      "0x4b0": 1372,
      "0x2000": 1373,
      "0x5f2": 1374,
      "0x11f": 1375,
      "0x780": 1376,
      "401": 1377,
      "ab4": 1378,
      "0x12320": 1379,
      "0x3ed": 1380,
      "0x450": 1381,
      "0x520": 1382,
      "0x19d": 1383,
      "stos": 1384,
      "0x394": 1385,
      "0x810": 1386,
      "0x18d": 1387,
      "0x382": 1388,
      "0x193": 1389,
      "0x244": 1390,
      "0x8c56c": 1391,
      "0x13b": 1392,
      "0x171": 1393,
      "0xffffffffffffffe0": 1394,
      "0x17f1c": 1395,
      "0x3bc": 1396,
      "0x490": 1397,
      "0x20d": 1398,
      "0x13f": 1399,
      "0x80048": 1400,
      "0x1fa": 1401,
      "9c4": 1402,
      "144": 1403,
      "0x1a9": 1404,
      "0x2bc": 1405,
      "7363": 1406,
      "225": 1407,
      "0xe06d": 1408,
      "ccccccd": 1409,
      "0x8239c": 1410,
      "ec8": 1411,
      "cmovo": 1412,
      "f44": 1413,
      "0x3b24": 1414,
      "b70": 1415,
      "0xd1500": 1416,
      "608": 1417,
      "30c": 1418,
      "f80": 1419,
      "0x27d": 1420,
      "0x221": 1421,
      "0x5c0": 1422,
      "cvtt": 1423,
      "0xe06d7363": 1424,
      "0x498": 1425,
      "0x598": 1426,
      "0x137f": 1427,
      "23e": 1428,
      "ymm": 1429,
      "0x4d0": 1430,
      "3c0": 1431,
      "6c8": 1432,
      "139": 1433,
      "0x1f7": 1434,
      "0x26f": 1435,
      "0x5d8c": 1436,
      "0x2eb": 1437,
      "0x32c": 1438,
      "0x374": 1439,
      "0x9e7": 1440,
      "0x17e": 1441,
      "d80": 1442,
      "644": 1443,
      "0x1ba": 1444,
      "0x2ec": 1445,
      "a04": 1446,
      "cmovbe": 1447,
      "0x365": 1448,
      "0x440": 1449,
      "0x87b": 1450,
      "fc0": 1451,
      "0x2a9": 1452,
      "0xc00000e5": 1453,
      "0x968": 1454,
      "0x19010": 1455,
      "0x1c7": 1456,
      "708": 1457,
      "0x299": 1458,
      "0x690": 1459,
      "0x383": 1460,
      "0x191": 1461,
      "0x3d4": 1462,
      "0x548": 1463,
      "7c4": 1464,
      "0xf3208": 1465,
      "0x500": 1466,
      "0x540": 1467,
      "0x10d4": 1468,
      "0x850": 1469,
      "0x155": 1470,
      "0x42f0": 1471,
      "0x2d4": 1472,
      "0xb62": 1473,
      "0x135": 1474,
      "0x214": 1475,
      "0x259": 1476,
      "0x1a6": 1477,
      "0x448": 1478,
      "0x4dc": 1479,
      "addss": 1480,
      "0x38c": 1481,
      "e80": 1482,
      "0x1a3": 1483,
      "0x4c8": 1484,
      "0xb424": 1485,
      "0x680": 1486,
      "9ce": 1487,
      "0x2c4": 1488,
      "0x22b": 1489,
      "0x2e1": 1490,
      "0x3dc": 1491,
      "0x333": 1492,
      "0x145": 1493,
      "0x17b": 1494,
      "0x1f1": 1495,
      "0x1fc": 1496,
      "784": 1497,
      "0x311": 1498,
      "0x7b470": 1499,
      "0x2dd": 1500,
      "0x361": 1501,
      "ed8": 1502,
      "0xb79": 1503,
      "0x196": 1504,
      "78c": 1505,
      "74c": 1506,
      "fffffff": 1507,
      "0x25a": 1508,
      "0xed8": 1509,
      "0x11df4": 1510,
      "eb4": 1511,
      "0x870": 1512,
      "0x408": 1513,
      "0x249": 1514,
      "0x1b1": 1515,
      "0x227": 1516,
      "0x1d3": 1517,
      "0x9910c": 1518,
      "0x2b1": 1519,
      "0x2e7": 1520,
      "0x207": 1521,
      "0x1cd": 1522,
      "780": 1523,
      "0x219": 1524,
      "0x1bd": 1525,
      "0x25b": 1526,
      "0x237": 1527,
      "0x80004001": 1528,
      "0x5ae8": 1529,
      "0x2f2": 1530,
      "0x36c": 1531,
      "0x362": 1532,
      "0x8dc": 1533,
      "0x605e": 1534,
      "0xf684": 1535,
      "0x241": 1536,
      "344": 1537,
      "0x3b9": 1538,
      "0x538": 1539,
      "0xa444": 1540,
      "588": 1541,
      "24c": 1542,
      "0xebb": 1543,
      "0x2e6": 1544,
      "0x3e3": 1545,
      "b44": 1546,
      "0x1d7": 1547,
      "0x80070002": 1548,
      "0x9b4b8": 1549,
      "0x2dd0": 1550,
      "0x3ac": 1551,
      "0x3f4": 1552,
      "edc": 1553,
      "0x192": 1554,
      "408": 1555,
      "70c": 1556,
      "184": 1557,
      "0x2f3": 1558,
      "0x35d": 1559,
      "0x4a0": 1560,
      "0x1cf0": 1561,
      "0x21d": 1562,
      "0x16e": 1563,
      "0x1d9": 1564,
      "0x1db": 1565,
      "0x236": 1566,
      "b1b": 1567,
      "0x549": 1568,
      "0x2b2": 1569,
      "0x3fe": 1570,
      "0x5e0": 1571,
      "0x9b2": 1572,
      "0x385": 1573,
      "0x14f": 1574,
      "0x1c04": 1575,
      "28c": 1576,
      "0x229": 1577,
      "0x4a8": 1578,
      "e4c": 1579,
      "0x1ad": 1580,
      "fbe": 1581,
      "508": 1582,
      "0x297": 1583,
      "dc8": 1584,
      "0x20628": 1585,
      "0x2e5": 1586,
      "0x2b7": 1587,
      "0x3f2": 1588,
      "0x434": 1589,
      "ff4": 1590,
      "0x92b": 1591,
      "e8c": 1592,
      "0x1df": 1593,
      "0x373": 1594,
      "0x577": 1595,
      "0x2aa": 1596,
      "0x2f9": 1597,
      "0x364": 1598,
      "0x600": 1599,
      "0x185": 1600,
      "0x313": 1601,
      "0x3e1": 1602,
      "0x454": 1603,
      "0x6f5": 1604,
      "0x40674": 1605,
      "0x13f8": 1606,
      "0x12e": 1607,
      "0x1f3": 1608,
      "704": 1609,
      "0x231": 1610,
      "0xc740": 1611,
      "0x2f1": 1612,
      "0x2ba": 1613,
      "0x3b1": 1614,
      "0x36a": 1615,
      "0x49c": 1616,
      "0xc12": 1617,
      "0x14e": 1618,
      "0x11e": 1619,
      "0x1c6": 1620,
      "0x1f000": 1621,
      "0x165": 1622,
      "98e": 1623,
      "0x267": 1624,
      "0xd820": 1625,
      "0x134e4": 1626,
      "0x3f1": 1627,
      "0x47c": 1628,
      "0x5b0": 1629,
      "0x18b": 1630,
      "0x404": 1631,
      "244": 1632,
      "0x22a": 1633,
      "0x2a3": 1634,
      "0x80000005": 1635,
      "0x2e2": 1636,
      "0x351": 1637,
      "0x18f": 1638,
      "0x409": 1639,
      "0x584c": 1640,
      "0x19a": 1641,
      "6c4": 1642,
      "0x4c0": 1643,
      "0x353": 1644,
      "0x301": 1645,
      "0x309": 1646,
      "0x13d0": 1647,
      "0x1280": 1648,
      "0x173": 1649,
      "0x1b7": 1650,
      "0x251": 1651,
      "0xfffffff8": 1652,
      "0x298dc": 1653,
      "5d0": 1654,
      "0x2dc": 1655,
      "0x2fa": 1656,
      "0x363": 1657,
      "0x4d9": 1658,
      "0x262": 1659,
      "51f": 1660,
      "0xabf8": 1661,
      "0x2e3": 1662,
      "0x6ed": 1663,
      "0x868": 1664,
      "0x24b": 1665,
      "188": 1666,
      "0x10000": 1667,
      "eac": 1668,
      "0xb28": 1669,
      "0x19b": 1670,
      "658": 1671,
      "0x384": 1672,
      "0x195": 1673,
      "0x1c2": 1674,
      "54c": 1675,
      "0x279": 1676,
      "f08": 1677,
      "b17": 1678,
      "0xed8f1": 1679,
      "0x201": 1680,
      "0x7b0": 1681,
      "0x211": 1682,
      "0x1b2": 1683,
      "0x31a": 1684,
      "172": 1685,
      "0x7ffffffffffffffe": 1686,
      "ff0": 1687,
      "0x203": 1688,
      "0x574": 1689,
      "0x718": 1690,
      "0x186": 1691,
      "0x9e6": 1692,
      "0x29b": 1693,
      "90c": 1694,
      "0x1d6": 1695,
      "0x1da": 1696,
      "0x1eb90": 1697,
      "ff8": 1698,
      "0x5488": 1699,
      "ccc": 1700,
      "0x1a5": 1701,
      "0x26a": 1702,
      "sd2": 1703,
      "0x323": 1704,
      "0x414": 1705,
      "0x7f0": 1706,
      "20c": 1707,
      "984": 1708,
      "0x24a": 1709,
      "bc8": 1710,
      "0x222": 1711,
      "0x226": 1712,
      "0x253": 1713,
      "0x233": 1714,
      "0x4f1b8": 1715,
      "0xbf50": 1716,
      "cvttsd2": 1717,
      "cvttsd2si": 1718,
      "0x3e2": 1719,
      "0x428": 1720,
      "0x86d": 1721,
      "0x1cf": 1722,
      "0x1f9": 1723,
      "0x16b": 1724,
      "2c4": 1725,
      "0x477": 1726,
      "0xa3f4": 1727,
      "0xffffff3f": 1728,
      "0x8000000000000000": 1729,
      "0x2fd": 1730,
      "0x3b4": 1731,
      "0x46d": 1732,
      "0x5d0": 1733,
      "108": 1734,
      "0x15f": 1735,
      "0x273": 1736,
      "0x243": 1737,
      "0x1a2": 1738,
      "0x2fb": 1739,
      "0x3e7": 1740,
      "0x3fd": 1741,
      "0x4a4": 1742,
      "0x462": 1743,
      "dd8": 1744,
      "0x7d0": 1745,
      "0x403": 1746,
      "0x1f2": 1747,
      "e87": 1748,
      "0x166": 1749,
      "0x239": 1750,
      "0x369": 1751,
      "0x35a": 1752,
      "0x405": 1753,
      "0x950": 1754,
      "0x7c0": 1755,
      "5555": 1756,
      "0xc0000023": 1757,
      "0x466": 1758,
      "0x45010": 1759,
      "0x5b4": 1760,
      "xmm7": 1761,
      "0x287": 1762,
      "0x580": 1763,
      "9c8": 1764,
      "0x1bb0": 1765,
      "0x3c4": 1766,
      "5d2": 1767,
      "0xa010": 1768,
      "0x9ff": 1769,
      "0xbb2": 1770,
      "0x172": 1771,
      "0x80004003": 1772,
      "520": 1773,
      "0x337": 1774,
      "0x42c": 1775,
      "0x494": 1776,
      "0x423": 1777,
      "ddc": 1778,
      "0x7f8": 1779,
      "0x8d0": 1780,
      "0x283": 1781,
      "0xd28": 1782,
      "a88": 1783,
      "38c": 1784,
      "0x2c1": 1785,
      "0x200000000000": 1786,
      "0x1fb": 1787,
      "0x22d": 1788,
      "9a9": 1789,
      "f60": 1790,
      "0x2f7": 1791,
      "0x76c": 1792,
      "0x7b7": 1793,
      "0x8dd": 1794,
      "0x9cc": 1795,
      "204": 1796,
      "0x13e": 1797,
      "0x1fa4": 1798,
      "489": 1799,
      "0x3fb": 1800,
      "0x474": 1801,
      "0xccccccccc": 1802,
      "58c": 1803,
      "0xa88": 1804,
      "0xcccccccccccccccd": 1805,
      "0x4b8": 1806,
      "0x630": 1807,
      "0x6cc": 1808,
      "0x387": 1809,
      "0xb10": 1810,
      "0x176": 1811,
      "e84": 1812,
      "544": 1813,
      "249": 1814,
      "0x3aa": 1815,
      "0x3e9": 1816,
      "0x798": 1817,
      "e04": 1818,
      "e88": 1819,
      "0x246": 1820,
      "0x247": 1821,
      "0x344": 1822,
      "0x2af": 1823,
      "0x205": 1824,
      "0x567": 1825,
      "0x7a4": 1826,
      "0xaf8": 1827,
      "0xd14": 1828,
      "0x175": 1829,
      "ecc": 1830,
      "0x212": 1831,
      "18c": 1832,
      "0x1d5": 1833,
      "0x1dcc": 1834,
      "0x7a86c": 1835,
      "0x3ab": 1836,
      "0x5b8": 1837,
      "0x30c": 1838,
      "0x40a": 1839,
      "0xbb0": 1840,
      "0xeec0": 1841,
      "0x29a": 1842,
      "788": 1843,
      "0x71bc": 1844,
      "0x2bd": 1845,
      "0x202": 1846,
      "e08": 1847,
      "48c": 1848,
      "3cf": 1849,
      "747": 1850,
      "0x252": 1851,
      "4c0": 1852,
      "idiv": 1853,
      "0x359": 1854,
      "0x6e8": 1855,
      "0x962": 1856,
      "0xc29": 1857,
      "0x1ca": 1858,
      "bc0": 1859,
      "0xfffffffb": 1860,
      "e00": 1861,
      "0x790": 1862,
      "0xa14": 1863,
      "0x1520": 1864,
      "0x216": 1865,
      "d4c": 1866,
      "0x232": 1867,
      "0x8000000b": 1868,
      "0xfde9": 1869,
      "0x3e5": 1870,
      "0x3fffffff": 1871,
      "008": 1872,
      "0x698": 1873,
      "0x890": 1874,
      "180": 1875,
      "bbc": 1876,
      "0x397": 1877,
      "0x424": 1878,
      "0x530": 1879,
      "0x550": 1880,
      "0x610": 1881,
      "0x620": 1882,
      "0x6b8": 1883,
      "0x786d8": 1884,
      "9c2": 1885,
      "0x271": 1886,
      "0x1b6": 1887,
      "mulss": 1888,
      "0x9d488": 1889,
      "0xc12b4": 1890,
      "0x3bb": 1891,
      "0x355": 1892,
      "0x352": 1893,
      "0x3b3": 1894,
      "0x463": 1895,
      "0x560": 1896,
      "0x590": 1897,
      "0x7ed": 1898,
      "0x7b8": 1899,
      "b0c": 1900,
      "0x213": 1901,
      "d88": 1902,
      "fc8": 1903,
      "0x1d2": 1904,
      "0x2a7": 1905,
      "0x3d20": 1906,
      "0x770": 1907,
      "0x28f": 1908,
      "0x920": 1909,
      "0x29d": 1910,
      "f88": 1911,
      "0x4fae0": 1912,
      "0x6d128": 1913,
      "0x3bd": 1914,
      "0x57c": 1915,
      "0x7b3": 1916,
      "0x8a0": 1917,
      "0x95b": 1918,
      "0xbaa": 1919,
      "f04": 1920,
      "0x880": 1921,
      "a4c": 1922,
      "f4c": 1923,
      "0x2d3": 1924,
      "cmovge": 1925,
      "0xa90": 1926,
      "0xd00000": 1927,
      "b84": 1928,
      "22e": 1929,
      "0x2d1": 1930,
      "0x10a40": 1931,
      "cmovle": 1932,
      "0x28d": 1933,
      "0x406": 1934,
      "0x40c": 1935,
      "0xa50": 1936,
      "104": 1937,
      "988": 1938,
      "246": 1939,
      "bbd": 1940,
      "0x31b": 1941,
      "e6a": 1942,
      "aab": 1943,
      "ef0": 1944,
      "0x3b7": 1945,
      "0x558": 1946,
      "0x648": 1947,
      "2080": 1948,
      "0x1c5": 1949,
      "a84": 1950,
      "a8c": 1951,
      "e52": 1952,
      "0x332": 1953,
      "0x3f3": 1954,
      "0x4cc": 1955,
      "0x41c": 1956,
      "0x4e6": 1957,
      "0x421": 1958,
      "0x7cc": 1959,
      "0x7d7": 1960,
      "0xa20": 1961,
      "3c4": 1962,
      "0x1ba0c": 1963,
      "0x5468": 1964,
      "0x87b2080": 1965,
      "f2c": 1966,
      "fff": 1967,
      "0x63c": 1968,
      "0x305": 1969,
      "0x28b": 1970,
      "0x88ae0": 1971,
      "0x2c3": 1972,
      "57f": 1973,
      "0x23a": 1974,
      "0x263": 1975,
      "53e": 1976,
      "0x6128": 1977,
      "0x12a0e8": 1978,
      "stosb": 1979,
      "0x6f518": 1980,
      "0x2fe": 1981,
      "ea8": 1982,
      "0x5ab": 1983,
      "0x531": 1984,
      "0x700": 1985,
      "0x389": 1986,
      "0x272": 1987,
      "0x27b": 1988,
      "0x393": 1989,
      "0x7fffffffffffffff": 1990,
      "0x83a": 1991,
      "0xee": 1992,
      "0x215": 1993,
      "0x2a1": 1994,
      "f00": 1995,
      "ea4": 1996,
      "0x3f9": 1997,
      "0x4fc": 1998,
      "0x8b8": 1999,
      "233": 2000,
      "e39": 2001,
      "0x2a5": 2002,
      "0x573c8": 2003,
      "0x6c0": 2004,
      "e64": 2005,
      "0x554": 2006,
      "0x660": 2007,
      "0xc010": 2008,
      "e0c": 2009,
      "f8c": 2010,
      "243": 2011,
      "0x317": 2012,
      "0x3d2": 2013,
      "0x767": 2014,
      "0x303": 2015,
      "0x9d8": 2016,
      "0x9fc": 2017,
      "0xd00": 2018,
      "0x1f6": 2019,
      "54f": 2020,
      "185": 2021,
      "0x417": 2022,
      "0xc0000409": 2023,
      "232": 2024,
      "0x32d": 2025,
      "0x9debc": 2026,
      "0xed30": 2027,
      "0x65dc": 2028,
      "e50": 2029,
      "0x760": 2030,
      "0x830": 2031,
      "0x9e0": 2032,
      "0x958": 2033,
      "0x9db": 2034,
      "0x19f": 2035,
      "605e": 2036,
      "a83": 2037,
      "0x2c9": 2038,
      "0x2cd": 2039,
      "mulsd": 2040,
      "0x411": 2041,
      "0x1af": 2042,
      "0x71b70": 2043,
      "0xacd0": 2044,
      "0x1c048": 2045,
      "0x6b0": 2046,
      "0x30208": 2047,
      "0xa00": 2048,
      "0x9b8": 2049,
      "d08": 2050,
      "0x245": 2051,
      "0x26d": 2052,
      "0x479c": 2053,
      "f76": 2054,
      "0x738c": 2055,
      "0xb62a0": 2056,
      "0x4bb": 2057,
      "0x451": 2058,
      "0x56d": 2059,
      "0x768": 2060,
      "0x740": 2061,
      "0x289": 2062,
      "0x977": 2063,
      "0x13b80": 2064,
      "0x277": 2065,
      "0x343": 2066,
      "e79": 2067,
      "0x327": 2068,
      "0xf04": 2069,
      "0x1ab4": 2070,
      "0x7e018": 2071,
      "1ec": 2072,
      "0x4000": 2073,
      "0x49a": 2074,
      "0x655": 2075,
      "addsd": 2076,
      "0x488": 2077,
      "604": 2078,
      "0x1fd": 2079,
      "388": 2080,
      "7c1": 2081,
      "94c": 2082,
      "0x23b": 2083,
      "0x5654": 2084,
      "0x25fec": 2085,
      "0xebb74": 2086,
      "0x3d7": 2087,
      "0x46c": 2088,
      "0x4b9": 2089,
      "0x433": 2090,
      "0xb99": 2091,
      "0x13010": 2092,
      "aca": 2093,
      "ace": 2094,
      "0x349": 2095,
      "f7a": 2096,
      "0x8c4": 2097,
      "0x634": 2098,
      "0x860": 2099,
      "0x1894": 2100,
      "0x242": 2101,
      "14a": 2102,
      "5c8": 2103,
      "23d": 2104,
      "fbf": 2105,
      "0x2d2": 2106,
      "0x3530": 2107,
      "0x364c": 2108,
      "0x4ea": 2109,
      "0x4d4": 2110,
      "0x427": 2111,
      "0x3084": 2112,
      "0x1f5": 2113,
      "0x315": 2114,
      "0x256": 2115,
      "0x329": 2116,
      "0x8007029c": 2117,
      "0x437": 2118,
      "0x528": 2119,
      "0x518": 2120,
      "0x56c": 2121,
      "dd4": 2122,
      "0x6e5": 2123,
      "0x77c": 2124,
      "b08": 2125,
      "0x2cb": 2126,
      "577": 2127,
      "0x412": 2128,
      "667": 2129,
      "0x265": 2130,
      "373": 2131,
      "0xfffffffc": 2132,
      "0x800704": 2133,
      "aaaaaaaaaaaa": 2134,
      "cvtsi2sd": 2135,
      "f98": 2136,
      "0x43c": 2137,
      "0x469": 2138,
      "0x42a": 2139,
      "0x5f0": 2140,
      "0xa30": 2141,
      "0x900": 2142,
      "0x19e": 2143,
      "9c5": 2144,
      "586": 2145,
      "0x379": 2146,
      "0x3a1c": 2147,
      "0xbbac": 2148,
      "0x156a0": 2149,
      "fa4": 2150,
      "0x3fa": 2151,
      "0x5ed": 2152,
      "0x6a0": 2153,
      "0x640": 2154,
      "0x670": 2155,
      "0x658": 2156,
      "0x729": 2157,
      "0x840": 2158,
      "0xd1d": 2159,
      "ecb": 2160,
      "501": 2161,
      "0x291": 2162,
      "902": 2163,
      "0x275": 2164,
      "0x34b": 2165,
      "0x3c9": 2166,
      "fd5": 2167,
      "f26": 2168,
      "0x33a": 2169,
      "0xbc10": 2170,
      "0x4e1": 2171,
      "0x4e3": 2172,
      "ffc": 2173,
      "0x570": 2174,
      "0x6e0": 2175,
      "0x653": 2176,
      "0x63d": 2177,
      "0x954": 2178,
      "0xb2a": 2179,
      "0xe00": 2180,
      "605": 2181,
      "247": 2182,
      "744": 2183,
      "0x2c7": 2184,
      "0x225": 2185,
      "f77": 2186,
      "d7b": 2187,
      "0x4d6": 2188,
      "0x36d": 2189,
      "0x566": 2190,
      "0x664": 2191,
      "0x710": 2192,
      "0x72c": 2193,
      "0x8f4": 2194,
      "0x15e": 2195,
      "60d": 2196,
      "ab9": 2197,
      "6c2": 2198,
      "5c3": 2199,
      "0x235": 2200,
      "e3f": 2201,
      "5a5": 2202,
      "0x336": 2203,
      "0x6f0": 2204,
      "0x7ffff": 2205,
      "0x7d8": 2206,
      "0x30d": 2207,
      "0x9000": 2208,
      "0x94c": 2209,
      "702": 2210,
      "abb": 2211,
      "ac4": 2212,
      "982": 2213,
      "9a1": 2214,
      "0x32b": 2215,
      "0x4e4": 2216,
      "00d": 2217,
      "0x6d0": 2218,
      "0x73a": 2219,
      "0x87c": 2220,
      "0xce4": 2221,
      "0x14a1": 2222,
      "0x1240": 2223,
      "481": 2224,
      "b4c": 2225,
      "0x2ca": 2226,
      "e73": 2227,
      "6d9": 2228,
      "0x3f6": 2229,
      "0x1cb00": 2230,
      "cvtsi2ss": 2231,
      "0x3f7": 2232,
      "0x457": 2233,
      "ffd": 2234,
      "0x539": 2235,
      "eb7": 2236,
      "eb9": 2237,
      "0x814": 2238,
      "0x800000": 2239,
      "0x918": 2240,
      "904": 2241,
      "f84": 2242,
      "285": 2243,
      "487": 2244,
      "584": 2245,
      "0x24d": 2246,
      "2c1": 2247,
      "946": 2248,
      "34b": 2249,
      "632": 2250,
      "0x32a": 2251,
      "fba": 2252,
      "0x82384": 2253,
      "0x76460": 2254,
      "0x9b210": 2255,
      "0x6dd": 2256,
      "0x674": 2257,
      "0x295": 2258,
      "782": 2259,
      "547": 2260,
      "3c9": 2261,
      "2ce": 2262,
      "0x25d": 2263,
      "9a6": 2264,
      "b1e": 2265,
      "e6d": 2266,
      "0x321": 2267,
      "6a2": 2268,
      "0x4bc": 2269,
      "0x4fd": 2270,
      "0x20f": 2271,
      "0x5e8": 2272,
      "0x638": 2273,
      "0x720": 2274,
      "0x858": 2275,
      "0x81c": 2276,
      "0x18e": 2277,
      "0x296": 2278,
      "24a": 2279,
      "24b": 2280,
      "0x347": 2281,
      "34c": 2282,
      "0x392": 2283,
      "239": 2284,
      "0x3790": 2285,
      "176": 2286,
      "675": 2287,
      "0x339": 2288,
      "0x14c00": 2289,
      "0x3e694": 2290,
      "0x1f0003": 2291,
      "cq": 2292,
      "ea6": 2293,
      "0x455": 2294,
      "0x4d7": 2295,
      "0x429": 2296,
      "0x20010": 2297,
      "0x568": 2298,
      "0x5bb": 2299,
      "0x7ac": 2300,
      "abc": 2301,
      "abd": 2302,
      "3ca": 2303,
      "0x881": 2304,
      "944": 2305,
      "94b": 2306,
      "fee": 2307,
      "0x26b": 2308,
      "e1e": 2309,
      "59b": 2310,
      "5af": 2311,
      "cqo": 2312,
      "0x4a7": 2313,
      "ff9": 2314,
      "0x5680": 2315,
      "0x6d8": 2316,
      "0x614c": 2317,
      "0x7bc": 2318,
      "0x8b0": 2319,
      "0x961": 2320,
      "10b": 2321,
      "0x21f": 2322,
      "0x27a": 2323,
      "0x16f": 2324,
      "983": 2325,
      "2c6": 2326,
      "0x2c6": 2327,
      "e43": 2328,
      "942": 2329,
      "57a": 2330,
      "0x255": 2331,
      "0x377": 2332,
      "69fa2": 2333,
      "e29": 2334,
      "0x325": 2335,
      "272": 2336,
      "273": 2337,
      "0x20c20": 2338,
      "0x54969fa2": 2339,
      "efa": 2340,
      "ead": 2341,
      "0x5ec": 2342,
      "001": 2343,
      "0x7dd": 2344,
      "0x864": 2345,
      "0xafa": 2346,
      "0xc3f": 2347,
      "0xd5c": 2348,
      "0x708": 2349,
      "50d": 2350,
      "0x292": 2351,
      "3c3": 2352,
      "987": 2353,
      "74e": 2354,
      "e33": 2355,
      "0x2a2": 2356,
      "0x3a3": 2357,
      "f56": 2358,
      "0x307e4": 2359,
      "0x5e4": 2360,
      "0x551": 2361,
      "0x8f0": 2362,
      "0xab1": 2363,
      "0x948": 2364,
      "60c": 2365,
      "502": 2366,
      "cc2": 2367,
      "e8f": 2368,
      "28e": 2369,
      "0x34a": 2370,
      "945": 2371,
      "aa3": 2372,
